Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེ་ནས་ཀཱ་ཤི་མཛེས་ལྡན་མ་དྲང་སྲོང་སྨྲ་བ་ག་ལ་བ་དེར་སོང་སྟེ། དེ་ཅི་སྲིད་དུ་བཞོན་པས་འགྲོ་བར་བྱ་བའི་ས་དེ་སྲིད་དུ་བཞོན་པས་སོང་ནས། བཞོན་པ་ལས་བབས་ཏེ་རྐང་པས་ཀུན་དགའ་ར་བར་སོང་ནས།
en: Kāśisundarī rode as far toward Ṛṣivadana as she could by vehicle, then descended from her vehicle and continued to the garden on foot.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: There she approached the Blessed One, touched her head to the feet of the Blessed One, drew down the right shoulder of her upper garment, bowed toward the Blessed One with palms pressed together, and requested,

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་བྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་མའི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན་
en: “Lord, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: བདག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་འཚལ་ལོ། །
en: In the presence of the Blessed One, I too wish to practice the holy life.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་འགུགས་པ་བཏང་སྟེ་དེ་ལ་གཏད་དོ། །སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱིས་ཀྱང་དེ་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: The Blessed One called Mahā­prajāpatī Gautamī, and Mahā­prajāpatī Gautamī led her to go forth as a novice, conferred on her full ordination, and instructed her.

source: དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Casting away all afflictive emotions through diligence, practice, and effort, she manifested arhatship.

source: དེ་དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས། གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: As an arhat, free from the attachments of the three realms, her mind regarded gold no differently than filth, and the palms of her hands as like space itself.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་དང་།
en: She had no regard for worldly profit, passion, or acclaim.

source: དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: She became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་ཀྱང་ཡ་མཚན་དུ་གྱུར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་དོ། །
en: The entire crowd of people was astonished, and all of them approached the Blessed One, touched their heads to the Blessed One’s feet, and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་པ་མཛད་དོ། །དེ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ལས་ཆོས་མཉན་ནས་རང་རང་གི་ཡུལ་དུ་དོང་ངོ་། །
en: The Blessed One taught them the Dharma particularly suited to them, and after they heard the Dharma from the Blessed One, each of them returned home.

source: བཅོམ་ལྡན་འདས་
en: “Blessed One,”

source: ཀཱ་ཤི་མཛེས་ལྡན་མས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རྒྱལ་པོའི་རིགས་སུ་སྐྱེས་ཏེ
en: “what action did Kāśisundarī take that ripened into her birth into a family of great means, prosperity, and wealth;

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་དང་བྱད་གཟུགས་དཔེ་མ་མཆིས་པར་གྱུར་ལ་
en: that she was well proportioned, pleasing to the eye, and beautiful—an unmatched figure;

source: དེས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ན། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: and that she pleased and did not displease the Blessed One, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?”

source: སྨོན་ལམ་གྱི་དབང་ལས་གྱུར་ཏོ། །
en: “It came about by the power of her prayers,”

source: བཙུན་པ་འདིས་སྨོན་ལམ་གང་དུ་བཏབ་ལགས།
en: “Lord, where did she make these prayers?”

source: དགེ་སློང་དག་
en: “Monks,”

source: སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན།
en: “in times past, in this fortunate eon, when people lived as long as twenty thousand years

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ་སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha Kāśyapa was in the world,

source: དེའི་ཚེ་གྲོང་ཁྱེར་བཱ་རཱ་ཎ་སཱི་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས།
en: there lived in the city of Vārāṇasī a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s.

source: ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནས། དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་
en: “When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ
en: As they enjoyed themselves and coupled, one day his wife conceived, and after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་རིགས་དང་འཐུན་པར་མིང་བཏགས་ཏེ་
en: At the elaborate feast celebrating her birth they named her according to their clan.

source: འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared her on milk, yogurt, butter, ghee, and milk solids, and she flourished like a lotus in a lake.

source: དེ་ནས་དེ་གང་གི་ཚེ་ཆེན་མོར་གྱུར་པ་དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས་
en: “When she grew up, she found faith in the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: དེས་ཕ་མ་ལ་གསོལ་ཏེ། རྣམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་གཙུག་ལག་ཁང་བརྩིགས་ནས། སངས་རྒྱས་འོད་སྲུང་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་ལ་ཕུལ་ཏེ།
en: She asked for her parents’ permission, built a monastery that was complete in every respect, offered it to Buddha Kāśyapa and the rest of the saṅgha of monks, and provided for all their needs.

source: དགེ་སློང་རྣམས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས་ཕ་མ་གཉིས་ལ་གསོལ་ཏེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་། །
en: Then she made another request of her parents and went forth as a novice in the doctrine of the totally and completely awakened Buddha Kāśyapa.

source: དེ་རབ་ཏུ་བྱུང་ནས་སྡེ་སྣོད་གསུམ་བསླབས་ཏེ་རིག་པ་དང་གྲོལ་བའི་སྤོབས་པ་དང་ལྡན་པའི་ཆོས་སྨྲ་བར་གྱུར་ཏོ། །
en: Once she had gone forth, she studied the Tripiṭaka and became a proponent of the Dharma with all the eloquence of her wisdom and freedom.

source: དེ་ནས་དེས་བསམས་པ།
en: “Thereupon she thought,

source: ཐོས་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་བདག་གིས་བྱས་ཟིན་གྱིས། མ་ལ་ད་ནི་བདག་གིས་བསམ་གཏན་ལ་འབད་པར་བྱའོ་སྙམ་དུ་བསམས་ནས།
en: ‘I have completed my studies. Now I will put my effort into meditation.’

source: ཡིད་ལ་བྱེད་པའི་ལུང་མནོས་ཏེ་སྲོད་དང་ཐོ་རངས་མི་ཉལ་བར་བརྩོན་པ་ལྷུར་བྱེད་པ་ལ་གནས་པས་བྱམས་པའི་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་བསྐྱེད་ནས། དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དེ།
en: She received instructions for contemplation, and through her earnest practice, foregoing sleep from dusk to dawn, she developed meditative stabilization on love and there practiced pure conduct all her life.

source: ཀྱེ་མ་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱས་པ་དང་རབ་ཏུ་བྱུང་ནས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་
en: ‘I have given gifts, made merit, gone forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, and practiced pure conduct all my life.

source: སྤྱད་པའི་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཅི་ནས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བ་དང་
en: By this root of virtue, wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་དང་བྱད་གཟུགས་དཔེ་མེད་པར་གྱུར་ཅིག །
en: May I be well proportioned, pleasing to the eye, and beautiful—an unmatched figure.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས། བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: May I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.’

source: དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་མ་གང་ཡིན་པ་དེ་ནི་ཀཱ་ཤི་མཛེས་ལྡན་མ་འདི་ཉིད་ཡིན་ཏེ
en: The one who went forth as a nun in the doctrine of the totally and completely awakened Buddha Kāśyapa then is now Kāśisundarī.

source: དེས་དེར་སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་པ་དང་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་
en: At that time she gave gifts, made merit, went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, and practiced pure conduct all her life.

source: བདག་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེ་བ་དང་།
en: ‘Wherever I am born, may it be into a family of great means, prosperity, and wealth.

source: བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ཏེགཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་དང་བྱད་གཟུགས་དཔེ་མེད་པར་གྱུར་ཏེ།
en: Those acts ripened such that she was born into a family of great means, prosperity, and wealth and was well proportioned, pleasing to the eye, and beautiful—an unmatched figure.

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ། ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: that she has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: དེས་དེར་བྱམས་པའི་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་བསྐྱེད་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་བྱད་གཟུགས་དཔེ་མེད་པར་གྱུར་ཏོ།། །།
en: And her development of meditative stabilization on love ripened such that wherever she was born, her beauty was unmatched.”

source: བདེ་བྱེད་མ་ཞེས་བྱ་བ་ནི།
en: The Story of Kṣemā

source: རྒྱལ་པོ་གསལ་རྒྱལ་རྒྱལ་པོ་བྱེད་ལ། བཱ་རཱ་ཎ་སཱི་ན་ནི་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་པ་ལས་
en: When the Blessed One was in Śrāvastī, King Prasenajit reigned in the city of Śrāvastī and King Brahmadatta reigned in Vārāṇasī.

source: དེ་གཉིས་ཕན་ཚུན་མི་འཐུན་པར་གྱུར་ཏེདུས་དུས་སུ་སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་དོ། །
en: The two did not agree with one another, and from time to time a great many people were killed.

source: དེ་ནས་ཕྱི་ཞིག་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ཏེ་ཀོ་ས་ལའི་ཡུལ་དུ་སོང་ནས་ཆུ་ཀླུང་ཁང་ལྡན་གྱི་འགྲམ་དུ་ཕྲུ་མ་བཏབ་སྟེ་འཁོད་དོ། །
en: One day King Brahmadatta arrayed the four divisions of his army and advanced on the kingdom of Kośala, where they made camp and stayed on the banks of the Ajiravatī River.

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཀྱང་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས། བདག་དང་གཡུལ་འགྱེད་དུ་འོངས་སོ་ཞེས་ཐོས་སོ། །
en: King Prasenajit heard that King Brahmadatta had arrayed the four divisions of his army and come to the city gates to wage war,

source: ཐོས་ནས་དེས་ཀྱང་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ནས་ཀཱ་ཤིའི་རྒྱལ་པོ་དང་གཡུལ་འགྱེད་དུ་སོང་སྟེ།
en: so he arrayed the four divisions of his army too and set out to wage war against Brahmadatta , King of Kāśi.

source: དེས་ཀྱང་ཆུ་ཀླུང་ཁང་ལྡན་གྱི་འགྲམ་དུ་ཕྲུ་མ་བཏབ་སྟེ་འཁོད་དོ། །
en: They too made camp and hunkered down on the banks of the Ajiravatī River.

source: དེ་ནས་དེ་གཉིས་དེ་ན་འཁོད་པས་ཕན་ཚུན་དུ་སྐྱེ་བོ་མང་པོ་ཁ་འདོག་པར་བྱེད་དོ། །
en: Many on each side were slaughtered while the two armies were stationed there.

source: དེ་གཉིས་ཀ་ཡང་མཐུ་ཆེ་ཞིང་ཚུགས་པར་དཀའ་བ་ཡིན་ཏེ། དེ་གཉིས་གཅིག་གིས་གཅིག་མི་ཐུབ་ཅིང་འདུག་གོ། །
en: Both sides were formidable and resistant to assault, and so it continued, with neither side able to defeat the other.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེ་ཁོ་ན་འཁོད་བཞིན་དུ་རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་བུ་མོ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་སོ། །
en: One day as they were hunkered down there, a daughter was born to King Prasenajit who was well proportioned, pleasing to the eye, and beautiful.

source: ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་བུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་ཀྱང་བཙས་ནས། དེར་དེ་གཉིས་སོ་སོའི་ཕོ་བྲང་འཁོར་དུ་དགའ་བའི་རོལ་མོ་བརྡུངས་སོ། །
en: A son who was well proportioned, pleasing to the eye, and beautiful had also been born to King Brahmadatta of Kāśi, so celebratory music resounded from both of their camps.

source: དེ་ནས་དེ་གཉིས་ཀྱིས་ཕན་ཚུན་དུ་ཐོས་ནས་
en: Hearing the music coming from both sides, the kings asked,

source: འདིར་དགའ་བའི་རོལ་མོ་བརྡུངས་པ་དེ་ཅི་ཞིག་ཅེས་
en: “What is all this celebratory music?”

source: བློན་པོ་རྣམས་ཀྱིས་བསྙད་དེ།
en: King Brahmadatta ’s ministers replied,

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་ནི་བུ་མོ་བཙས། ལྷའི་ནི་སྲས་པོ་བལྟམ་མོ་ཞེས་བྱས་སོ། །
en: “It is for the birth of King Prasenajit’s daughter, and for you, Deva, upon the arrival of your son,”

source: རྒྱལ་པོ་གསལ་རྒྱལ་གྱི་བློན་པོ་རྣམས་ཀྱིས་ཀྱང་བསྙད་དེ།
en: and King Prasenajit’s ministers replied,

source: ལྷའི་ནི་སྲས་མོ་བལྟམ། རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་ནི་བུ་ཕོ་བཙས་སོ་ཞེས་བྱས་སོ། །
en: “It is for you, Deva, upon the arrival of your daughter, and for the birth of King Brahmadatta ’s son.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དེ་གཉིས་དགའ་བར་གྱུར་ཏེ།
en: When they heard this, both were in good spirits, and thought,

source: བདག་ཅག་གཉིས་ཕན་ཚུན་དགྲར་མི་བྱེད་པར་གཉེན་བྱེད་པའི་ཐབས་རྙེད་དོ་སྙམ་མོ། །
en: “We should not treat each other as enemies now that we have the means to become kin!”

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་རྒྱལ་པོ་གསལ་རྒྱལ་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: King Brahmadatta sent an envoy to King Prasenajit with the message,

source: ཁྱོད་ཀྱི་བུ་མོ་བཙས་པ་དེ་བདག་གི་བུ་འདིའི་ཆུང་མར་བྱིན་ཅིག་ཅེས་སྤྲིང་ངོ་། །
en: “Please give your newborn daughter to my son in marriage.”

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བསམས་པ་
en: King Prasenajit thought,

source: ཐབས་འདིས་ནི་བདག་ཇི་སྲིད་འཚོའི་བར་དུ། རྒྱལ་པོ་ཚངས་པས་བྱིན་དང་མཛའ་བར་འགྱུར་རོ་
en: “This will be a way to make friends with King Brahmadatta for the rest of my life,”

source: སྙམ་ནས་དེས་ཀྱང་དེ་ལ་ཕོ་ཉ་བཏང་སྟེ་
en: and sent an envoy to King Brahmadatta with the response,

source: ཇི་ལྟར་དགའ་བ་དེ་བཞིན་དུ་བྱའོ་
en: “I shall comply with your wish.”

source: དེ་གཉིས་གཅིག་ལ་གཅིག་བཟོད་པ་གསོལ་ཏེ་མཛའ་བོ་བྱས་ནས་
en: The two asked forgiveness of one another and made friends.

source: གཅིག་གིས་ཀྱང་བུ་མོ་ལ་གོས་དང་རྒྱན་མང་པོ་བསྐུར་རོ། །གཅིག་གིས་ཀྱང་ཁྱེའུ་ལ་གོས་དང་རྒྱན་མང་པོ་བསྐུར་ཏེ།
en: One sent a great wealth of clothing and finery for the girl, and the other sent much clothing and finery for the boy.

source: དེ་གཉིས་ཕན་ཚུན་གཉེན་དུ་བྱས་ནས་མགུལ་ནས་འཇུས་ཏེ་ཡུལ་དེ་ནས་དོང་ངོ་། །
en: As friends, the two now departed the region with their arms around each other’s shoulders.

source: བུ་མོ་འདི་བཙས་པས་ང་རྒྱལ་པོ་ཚངས་པས་བྱིན་དང་བདེ་བར་གྱུར་ཏོ་སྙམ་ནས།
en: “Since the birth of my daughter, I am happy with King Brahmadatta ,”

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ཏེ། མིང་བདེ་བྱེད་མ་ཞེས་བཏགས་སོ། །
en: so he named her Kṣemā (She Who Brings Happiness) at the elaborate feast celebrating her birth.

source: དེ་ནས་བུ་མོ་བདེ་བྱེད་མ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared her on milk, yogurt, butter, ghee, and milk solids, and she flourished like a lotus in a lake.

source: དེ་ནས་གང་གི་ཚེ་ཆེན་མོར་གྱུར་པ་དེའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་དེ། དེས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་ནས། སྦྱིན་པ་དག་བྱིན་ཏེ་བསོད་ནམས་དག་བྱས་སོ། །དགེ་སློང་མའི་གཙུག་ལག་ཁང་དུ་ཡང་རྒྱུན་མི་འཆད་པར་འགྲོ་ཞིང་ཆོས་ཉན་ཏོ། །
en: When she grew up she found faith in the doctrine of the Blessed Buddha, went for refuge and took the fundamental precepts, made merit, and went continually to the nunnery to listen to the Dharma.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: So it was that one day she manifested the resultant state of non-return and attained miraculous powers.

source: རྫུ་འཕྲུལ་ཡང་བསྒྲུབས་ནས། རྫུ་འཕྲུལ་ཆེན་མོ་མཐུ་ཆེན་མོ་རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པར་གྱུར་ཏོ། །
en: Endowed with great power and magical abilities, she achieved concentration on the eight liberations.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེས་ཕ་མ་གཉིས་ཀྱི་མདུན་དུ་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་བསྟན་ཏེ་སྨྲས་པ།
en: She demonstrated the miracle of her magical abilities for her parents, and said,

source: ཡབ་ཡུམ་བདག་གིས་ནི་ཆོས་འདི་ལྟ་བུ་ཐོབ་པས་ན་འདོད་པ་ཡོངས་སུ་སྤྱོད་པའི་རྔོ་མི་ཐོགས་ཀྱིས། བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བ་གནང་བར་མཛད་དུ་གསོལ།
en: “Mother, Father, now that I have achieved these things, I cannot engage in sexual relations, so I am asking for your kind permission to go forth in the doctrine of the Blessed One.”

source: ཕ་མ་གཉིས་ཀྱིས་སྨྲས་པ།
en: her parents said,

source: བུ་མོ་ཁྱོད་བཙས་མ་ཐག་ཏུ་
en: “My child, we cannot allow this,”

source: བདག་ཅག་གིས་ཁྱིམ་ཐབ་ལ་བྱིན་ཟིན་གྱིས་བདག་ཅག་གིས་གནང་བར་བྱར་མི་རུང་ངོ་། །
en: “for we betrothed you as soon as you were born.

source: དེ་ལྟ་མོད་ཀྱི་བདག་ཅག་གིས་དེ་ལ་བཟླུགས་ཏེ། དེ་དང་བདག་ཅག་ཅི་ནས་ཕྱིས་འཁོན་དུ་མི་འགྱུར་བར་བྱས་ལ། བག་མ་ལེན་པ་འོངས་ནས་ཁྱོད་ཉིད་ཀྱིས་ཁྱིམ་ཐབ་ལ་གསོལ་བ་ཐོབ་ལ་རབ་ཏུ་འབྱུང་བར་གྱིས་ཤིག་ཅེས་བྱས་སོ། །
en: We have already sent our word and set aside our dispute, but still—when the wedding party comes for you, you can make your request to the groom and go forth, should he agree.”

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: Then King Prasenajit sent an envoy to King Brahmadatta with the message,

source: བུ་མོ་བདེ་བྱེད་མ་ནི་རབ་ཏུ་འབྱུང་བར་འདོད་དེ་བཟློག་པར་མི་ནུས་ཀྱི་མ་ཐོགས་པར་བག་མ་ལོང་ཤིག་ཅེས་སྤྲིང་ངོ་། །
en: “Our daughter Kṣemā wishes to go forth. We cannot stop her. Do not delay in making her a bride.”

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཀྱང་ཕོ་ཉ་བཏང་སྟེ།
en: King Brahmadatta likewise sent an envoy with the response,

source: ཚེས་གྲངས་འདི་ལ་འོང་གིས་བག་མ་བཏང་བའི་སྟ་གོན་གྱིས་ཤིག་ཅེས་སྤྲིང་ངོ་། །
en: “I shall come on such-and-such a date. Start making preparations for her to be sent away as a bride.”

source: དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་ཐོས་མ་ཐག་ཏུ་བག་མ་བཏང་བའི་སྟ་གོན་བྱས་སོ། །
en: When King Prasenajit heard this, he began making preparations to send her away as a bride.

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་ཀྱང་བུ་འབྱོར་པ་ཆེན་པོ་དང་རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་ལྡན་པས་བཏང་ངོ་། །དེ་ནས་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་དེ་བཀུར་སྟི་ཆེན་པོས་མཉན་དུ་ཡོད་པར་གཡར་དྲངས་སོ། །
en: King Brahmadatta then sent his son with great riches and a great show of force, whereupon King Prasenajit respectfully led the delegation into Śrāvastī.

source: གཡར་དྲངས་ནས་རང་གི་ཕོ་བྲང་དུ་སྟེགས་བུ་བྱས་ཏེ། རྒྱན་གྱིས་བརྒྱན་ནས་དེར་སྐྱེ་བོ་ཕལ་ཆེར་འདུས་སོ། །
en: Once the wedding delegation had been led in, an altar was erected and decorated with ornaments, and many people gathered there.

source: བུ་མོ་དེ་ཡང་རྒྱན་ཐམས་ཅད་ཀྱིས་བཀླུབས་ནས་སྟེགས་བུ་བརྒྱན་པ་དེའི་སྟེང་དུ་དྲངས་ཏེ་བཞག་གོ། །
en: They clad the young woman in every type of adornment and led her to her place at the decorated altar.

source: ཁྱེའུ་དེ་ཡང་སྟེགས་བུ་བརྒྱན་པ་དེའི་སྟེང་དུ་བཏང་སྟེ་བུ་མོ་བདེ་བྱེད་མ་དྲང་བར་བྱས་པ་ལས།
en: Then the young man too was led to the decorated altar, and he turned and beckoned to young Kṣemā.

source: དེའི་སྟེང་གི་བར་སྣང་ལ་འཕགས་ཏེ་འབར་བ་དང་། ལམ་མེར་འདུག་པ་དང་ཆར་འབབ་པ་དང་གློག་འགྱུ་བའི་ཆོ་འཕྲུལ་རྣམས་བསྟན་ཏོ། །
en: Suddenly she rose up into the sky and gave a miraculous display of fire and light, rain and lightning.

source: དེ་ནས་ཁྱེའུ་དེ་དང་སྐྱེ་བོ་དེ་དག་གིས་མཐོང་མ་ཐག་ཏུ་བདེ་བྱེད་མ་ལ་དགའ་བ་ཆེན་པོ་སྐྱེས་སོ། །དེ་ནས་ཁྱེའུ་དེས་བསམས་པ།
en: When the young man and the many others saw this they experienced a surge of tremendous joy toward Kṣemā, and the young man thought,

source: གལ་ཏེ་འདི་ལྟ་བུའི་ཡོན་ཏན་དག་ཐོབ་པ་ཡིན་ན། འདི་བདག་དང་ལྷན་ཅིག་ཏུ་འདོད་པ་ཡོངས་སུ་སྤྱོད་པར་ག་ལ་འགྱུར་
en: “How could she engage in sexual relations with me, now that she has attained such great virtues?”

source: སྨྲས་པ།
en: He called out to her,

source: བཟང་མོ་མར་སྤྱོན་དང་ཁྱོད་ཉིད་ཅི་དགར་འདམ་དུ་གཞུག་གོ། །
en: “Fine woman, come down! I’ll let you decide as you please!”

source: བདེ་བྱེད་མས་སྨྲས་པ།
en: Kṣemā told him,

source: ཇོ་བོ་བདག་ནི་འདོད་པ་ཡོངས་སུ་སྤྱོད་པའི་རྔོ་མི་ཐོགས་ཀྱིས་བདག་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བར་གནང་བར་མཛོད་ཅིག །
en: “Lord, I cannot engage in sexual relations with you—please give your consent to my going forth in the doctrine of the Blessed One.”

source: གནང་ངོ་། །
en: “Given,”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བུ་མོ་བདེ་བྱེད་མ་བབས་ཏེ། དེས་སྐྱེ་བོའི་ཚོགས་དེ་དག་ལ་ཆོས་བསྟན་ནས་
en: Young Kṣemā immediately descended and gave a Dharma teaching to the people.

source: ཕ་མ་གཉིས་ལ་གསོལ་ཏེ། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་སོང་ནས། དེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then she asked for her parents’ permission, went to the garden of Prince Jeta, approached the Blessed One, touched her head to the Blessed One’s feet, and requested,

source: བཙུན་པ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་མའི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་ལ་གཏད་དོ། །
en: Thereupon the Blessed One presented her to Mahā­prajāpatī.

source: སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱིས་ཀྱང་དེ་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: Mahā­prajāpatī led her to go forth as a novice, conferred on her full ordination, and instructed her.

source: དགྲ་བཅོམ་པ་ཁམས་གསུམ་པའི་འདོད་ཆགས་དང་བྲལ་བར་གྱུར་ནས། གསེར་དང་བོང་བར་མཉམ་པ། ནམ་མཁའ་དང་ལག་མཐིལ་དུ་འདྲ་བའི་སེམས་དང་ལྡན་པ།
en: As an arhat, free from the attachments of the three realms, her mind regarded gold no differently than filth, and the palms of her hands as like space itself.

source: རིག་པ་དང་མངོན་པར་ཤེས་པ་དང་ས་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ།
en: She achieved the insights, superknowledges, and discriminations.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ།
en: She had no regard for worldly profit, passion, or acclaim.

source: དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏེབཅོམ་ལྡན་འདས་ཀྱིས་ཤེས་རབ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: Her state was such that Indra, Upendra, and the other gods worshiped and venerated her and addressed her with respect, and the Blessed One commended her as foremost among the wise.

source: བདེ་བྱེད་མ་དེ་ལྟར་རབ་ཏུ་བྱུང་ནས་རྒྱལ་པོའི་བུ་དེས་བསམས་པ།
en: After Kṣemā had gone forth in this way, the king’s son thought,

source: བུད་མེད་ཀྱིས་ཀྱང་འདི་ལྟ་བུའི་ཆོས་རྟོགས་པར་འགྱུར་ན། མ་ལ་བདག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་གོར་མ་ཆག་
en: “If even a woman can have such realizations of the Dharma, surely I can go forth in the Blessed One’s doctrine as well.”

source: སྙམ་དུ་བསམས་ནས་དེས་ཀྱང་ཕ་མ་ལ་གསོལ་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། དེས་ཀྱང་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: With this thought, he likewise asked for his parents’ permission, and, casting away all afflictive emotions through diligence, practice, and effort, he manifested arhatship.
